app/Controllers/Admin.php

    public function detail($id = 0)
    {
     $data['title'] ='User Detail';

     $this->builder->select('users.id as userid, username, fullname, user_image, email, name, status_message');
     $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
     $this->builder->join('auth_groups', 'auth_groups.id =auth_groups_users.group_id');
     $this->builder->where('users.id', $id);
     $query = $this->builder->get();
---
SELECT `users`.`id` as `userid`, `username`, `fullname`, `user_image`, `email`, `name`, `status_message`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` =`auth_groups_users`.`group_id`
WHERE `users`.`id` = '4'