app/Controllers/Manage.php

SELECT `users`.`id` as `userid`, `username`, `fullname`, `user_image`, `email`, `name`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
WHERE `auth_groups`.`name` = 'mitra'
---
    public function mitra()
    {
        $data['title']= 'Mitra List';

        $this->builder->select('users.id as userid, username, fullname, user_image, email, name');
        $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
        $this->builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');
        $this->builder->where('auth_groups.name', 'mitra');
        $query = $this->builder->get();

SELECT `users`.`id` as `userid`, `username`, `fullname`, `user_image`, `email`, `name`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
WHERE `auth_groups`.`name` = 'staff'
---
    public function staff()
    {
        $data['title']= 'Staff List';

        $this->builder->select('users.id as userid, username, fullname, user_image, email, name');
        $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');

SELECT `users`.`id` as `userid`, `username`, `fullname`, `user_image`, `email`, `name`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
WHERE `auth_groups`.`name` = 'user'
---
    public function user()
    {
        $data['title']= 'User List';

        $this->builder->select('users.id as userid, username, fullname, user_image, email, name');
        $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
        $this->builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');
        $this->builder->where('auth_groups.name', 'user');
        $query = $this->builder->get();

SELECT `users`.`id` as `userid`, `username`, `fullname`, `user_image`, `email`, `name`, `status_message`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` =`auth_groups_users`.`group_id`
WHERE `users`.`id` = '11'
---
    public function editindex($id){
         $data['title'] ='Edit User';

         $this->builder->select('users.id as userid, username, fullname, user_image, email, name, status_message');
         $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
         $this->builder->join('auth_groups', 'auth_groups.id =auth_groups_users.group_id');
         $this->builder->where('users.id', $id);
         $query = $this->builder->get();