app/Controllers/Uploadktp.php

INSERT INTO `admin_users` (`ktp`) VALUES ('WhatsApp Image 2022-09-18 at 13.41.42.jpeg')
---
    public function uploadktp()
    {

      helper(['uploadktp', 'url']);

      $db      = \Config\Database::connect();
          $builder = $db->table('admin_users');

         $validated = $this->validate([
             'file' => [
                 'uploaded[file]',
                 'mime_in[file,image/jpg,image/jpeg,image/gif,image/png]',
                 'max_size[file,4096]',
             ],
         ]);

         $msg = 'Please select a valid file';

         if ($validated) {
             $avatar = $this->request->getFile('file');
             $avatar->move(WRITEPATH . 'uploads');

           $data = [

             'ktp' =>  $avatar->getClientName(),
           ];

           $save = $builder->insert($data);